# ReinEstNumberOfBars Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReinEstNumberOfBars Property
ParameterTypeId Class See Also
---
"Estimated Number of Bars"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReinEstNumberOfBars { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReinEstNumberOfBars As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReinEstNumberOfBars {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace